// Нажммите зелёную ► слева от этой строки и выберите "Run 'CKt'"
fun main() = robot("c1", 5)    // Зелёным цветом выделен номер текущего задания
// Прочитайте задание. Напишите решение в виде функции: fun cN() { решение }, где N - номер задания
// Используйте команды робота:
//          left(), right(), up(), down() - движение робота
//          paint() - перекраска клетки в зелёный цвет
// Для повторяющихся действий используйте блок повтора:     repeat(10) {...}
// Либо, вместо него - оператор цикла со счётчиком for:     for(i in 1..10) {...}
// Пример решённого первого задания:
fun c1() {
    repeat(10) {
        right()
    }
}
// Нажммите зелёную ► (или Shift+F10) ещё раз, и убедитесь, что задача решена верно.

// Поменяйте номер задания в зелёной строке "c1" (вторая строка этого текста)
// Нажммите зелёную ►, прочитайте и решите аналогичным способом следующее задание:
fun c2() {
    // пишите решение задачи №2 здесь
}

// Продолжайте решать задачи до номера c16 включительно
fun c3() {
    // пишите решение задачи №3 здесь...
}
